Script started on 2024-04-15 22:31:34-04:00 [TERM="xterm-256color" TTY="/dev/pts/2" COLUMNS="106" LINES="30"]
[34;1m๏ผ  ~/.../Projects/Project3 [32;1m๏  ๏ฆ main U:4 ?:6 [31;1mโ[0m [0;30mยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยท[106G[1K[1A[23D [33;1msanju@XPS-13 [97;1m๏ 22:31:34
[32;1mโฏ [0mrm ./logs/iperf.log [C[Cscript logs/iperf.log[C[C[10Piperf h4 h5[C[Cscript logs/dump.log[C[C[C[2Pudo ./project3.py
[sudo] password for sanju: 
Unable to contact the remote controller at 127.0.0.1:6653
mininet> exitdumpexitpingall[3Pexitdumpexit[Kiperf h4 h5
*** Iperf: testing TCP bandwidth between h4 and h5 
^C
Interrupt
mininet> iperf h4 h5[K[K[K[K1 h2
*** Iperf: testing TCP bandwidth between h1 and h2 
*** Results: ['50.2 Gbits/sec', '50.2 Gbits/sec']
mininet> iperf h1 h2[K3
*** Iperf: testing TCP bandwidth between h1 and h3 
*** Results: ['51.6 Gbits/sec', '51.8 Gbits/sec']
mininet> iperf h1 h3[K5[K4
*** Iperf: testing TCP bandwidth between h1 and h4 
*** Results: ['53.4 Gbits/sec', '53.5 Gbits/sec']
mininet> iperf h1 h4[K5
*** Iperf: testing TCP bandwidth between h1 and h5 
*** Results: ['51.2 Gbits/sec', '51.4 Gbits/sec']
mininet> iperf h1 h5[K[K[K[K2 h1
*** Iperf: testing TCP bandwidth between h2 and h1 
*** Results: ['50.5 Gbits/sec', '50.6 Gbits/sec']
mininet> iperf h2 h1[K3
*** Iperf: testing TCP bandwidth between h2 and h3 
*** Results: ['49.8 Gbits/sec', '50.0 Gbits/sec']
mininet> iperf h2 h3[K4
*** Iperf: testing TCP bandwidth between h2 and h4 
*** Results: ['54.4 Gbits/sec', '54.4 Gbits/sec']
mininet> iperf h2 h4[K5
*** Iperf: testing TCP bandwidth between h2 and h5 
*** Results: ['51.1 Gbits/sec', '51.1 Gbits/sec']
mininet> iperf h2 h5[K1[1P h13 h1
*** Iperf: testing TCP bandwidth between h3 and h1 
*** Results: ['50.7 Gbits/sec', '50.9 Gbits/sec']
mininet> iperf h3 h1[K2
*** Iperf: testing TCP bandwidth between h3 and h2 
*** Results: ['51.8 Gbits/sec', '51.8 Gbits/sec']
mininet> iperf h3 h2[K4
*** Iperf: testing TCP bandwidth between h3 and h4 
*** Results: ['54.1 Gbits/sec', '54.1 Gbits/sec']
mininet> iperf h3 h4[K5
*** Iperf: testing TCP bandwidth between h3 and h5 
*** Results: ['50.8 Gbits/sec', '50.8 Gbits/sec']
mininet> iperf h3 h5[K[1P h4 h[C[C1
*** Iperf: testing TCP bandwidth between h4 and h1 
*** Results: ['53.9 Gbits/sec', '53.8 Gbits/sec']
mininet> iperf h4 h1[K2
*** Iperf: testing TCP bandwidth between h4 and h2 
*** Results: ['53.3 Gbits/sec', '53.3 Gbits/sec']
mininet> iperf h4 h2[K3
*** Iperf: testing TCP bandwidth between h4 and h3 
*** Results: ['53.8 Gbits/sec', '53.8 Gbits/sec']
mininet> iperf h4 h3[K5
*** Iperf: testing TCP bandwidth between h4 and h5 
^C
Interrupt
mininet> iperf h4 h5[K[K[K[K5 h1
*** Iperf: testing TCP bandwidth between h5 and h1 
*** Results: ['50.8 Gbits/sec', '50.8 Gbits/sec']
mininet> iperf h5 h1[K2
*** Iperf: testing TCP bandwidth between h5 and h2 
*** Results: ['51.0 Gbits/sec', '51.0 Gbits/sec']
mininet> iperf h5 h2[K3
*** Iperf: testing TCP bandwidth between h5 and h3 
*** Results: ['49.3 Gbits/sec', '49.3 Gbits/sec']
mininet> iperf h5 h3[K4
*** Iperf: testing TCP bandwidth between h5 and h4 
^C
Interrupt
mininet> exit
[34;1m๏ผ  ~/.../Projects/Project3 [32;1m๏  ๏ฆ main U:4 ?:6 [31;1mโ[0m [0;30mยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยทยท[106G[1K[1A[32D [34;1m๏ 4m 18s [31;1msanju@XPS-13 [97;1m๏ 22:35:57
[32;1mโฏ [0mexit
exit

Script done on 2024-04-15 22:35:59-04:00 [COMMAND_EXIT_CODE="0"]
